app/Http/Controllers/Owner/ImageController.php

    public function index()
    {
        $images = Image::where('owner_id', Auth::id())
        ->orderBy('updated_at', 'desc')
        ->paginate(20);
---
select count(*) as aggregate from `images` where `owner_id` = 1