app/Http/Controllers/Admin/OwnersController.php

select `id`, `name`, `email`, `created_at` from `owners` where `owners`.`deleted_at` is null limit 3 offset 3
select count(*) as aggregate from `owners` where `owners`.`deleted_at` is null
---
    public function index()
    {
        // $date_now = Carbon::now();
        // $date_parse = Carbon::parse(now());
        // echo $date_now->year;
        // echo $date_parse;

        // $e_all = Owner::all();
        // $q_get = DB::table('owners')->select('name','created_at')->get();
        // $q_first = DB::table('owners')->select('name')->first();

        // $c_test = collect([
        //     'name' =>'テスト',
        // ]);

        // var_dump($q_first);
        // dd($e_all, $q_get, $q_first, $c_test);
        $owners = Owner::select('id','name', 'email', 'created_at')
        ->paginate(3);

insert into `owners` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('test8', 'test8@test.com', '$2y$10$IQFtVZhx/ZjrmKyEty83gefyUtst8Nnr0hblyoVZydEn7.svXD4BK', '2022-08-04 14:18:48', '2022-08-04 14:18:48')
insert into `shops` (`owner_id`, `name`, `information`, `filename`, `is_selling`, `updated_at`, `created_at`) values (8, '', '', '', 1, '2022-08-04 14:18:48', '2022-08-04 14:18:48')
---
    public function store(Request $request)
    {
        // $request->name;
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:owners',
            'password' => 'required|string|confirmed|min:8',
        ]);

        try{
            DB::transaction(function() use($request){
                $owner = Owner::create([
                    'name' => $request->name,
                    'email' => $request->email,
                    'password' => Hash::make($request->password),
                ]);

                Shop::create([
                    'owner_id' => $owner->id,
                    'name' => '店名を入力してください',
                    'information' =>'',
                    'filename' =>'',
                    'is_selling'=>true,
                ]);

select * from `owners` where `owners`.`id` = '1' and `owners`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        $owner = Owner::findOrFail($id);

select * from `owners` where `owners`.`id` = '2' and `owners`.`deleted_at` is null limit 1
select * from `owners` where `owners`.`deleted_at` is not null
---
    public function update(Request $request, $id)
    {
        $owner = Owner::findOrFail($id);
        $owner->name = $request->name;
        $owner->email = $request->email;
        $owner->password = Hash::make($request->password);
        $owner->save();

        return redirect()
        ->route('admin.owners.index')
        ->with(['message'=>'オーナー情報を更新しました。','status'=>'info']);

delete from `owners` where `id` = 2
select * from `owners` where `owners`.`id` = '8' and `owners`.`deleted_at` is null limit 1
update `owners` set `deleted_at` = '2022-08-04 14:36:11', `owners`.`updated_at` = '2022-08-04 14:36:11' where `id` = 8
---
    public function destroy($id)
    {
        Owner::findOrFail($id)->delete(); //ソフトデリート

select * from `owners` where `owners`.`deleted_at` is not null
---
    public function expiredOwnerIndex(){
        $expiredOwners = Owner::onlyTrashed()->get();

delete from `owners` where `id` = 1
select * from `owners` where `owners`.`deleted_at` is not null and `owners`.`id` = '1' limit 1
---
    public function expiredOwnerDestroy($id){
        Owner::onlyTrashed()->findOrFail($id)->forceDelete();