app/Http/Controllers/Admin/OwnersController.php

    public function edit($id)
    {
        $owner = Owner::findOrFail($id);
---
select * from `owners` where `owners`.`id` = '1' and `owners`.`deleted_at` is null limit 1

    public function destroy($id)
    {
        Owner::findOrFail($id)->delete(); //ソフトデリート
---
update `owners` set `deleted_at` = '2022-08-04 11:56:51', `owners`.`updated_at` = '2022-08-04 11:56:51' where `id` = 2